import Image from "next/image";

export default function Home() {
  return (
    <div>
      <main>
        <h1>awdawd</h1>
      </main>
    </div>
  );
}

// CSR - Client Side Rendering - то что вы знаете (рендеринг происходит у клиента), то есть html изначально пустой, а уже потом собирается у клиента
// SSR - Server Side Rendering - html генерируется на сервере, то есть весь html собирается на сервере, а клиенту приходит готовый
// SSG - Static Site Generation - один раз собирает html и выдает сразу готовый и на сервере ничего не собирает
// ISR - Incremental Static Regeneration - гибрид SSR и SSG. собирает контент как и SSG, но раз в к примеру неделю заново пересобирает весь контент
// либо как вариант можно сделать так, чтобы страница пересобиралась когда вы делаете публикацию

// 'use client' в начале файла позволяет использовать хуки реакта, но не делает ее CSR
// dynamic загрузка показанная в примере делает ее CSR и контент загружается только у клиента
